#pragma once

//максимальный элемент кратный 3
int task1(int* a, int size);

//минимальный элемент, оканчивающийся на 4
int task2(int* a, int size);

//сумма четных
int task3(int* a, int size);

//максимальный элемент кратный 7 и оканчивающийся на 9
int task4(int* a, int size);

//количество четных элементов больших 7 и меньших 78
int task5(int* a, int size);

//макс четный элемент, если кол-во четных больше нечетных и наоборот, если равно, то сумма массива
int task6(int* a, int size);

//среднее арифм элементов кратных 7
int task7(int* a, int size);

//процент положительных элементов
int task8(int* a, int size);

//разность между четными и нечет
int task9(int* a, int size);

//разность между суммой элементов, кратных 3 и произведением элементо, кратных 7
int task10(int* a, int size);

//второй максимум
int task11(int* a, int size);